tutorials/compressible/nexaFoam/neTCLib/bluntedCone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cone
    {
        type            wall;
        nFaces          600;
        startFace       239200;
    }
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       239800;
    }
    wedge1
    {
        type            wedge;
        nFaces          120000;
        startFace       240400;
    }
    wedge2
    {
        type            wedge;
        nFaces          120000;
        startFace       360400;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       480400;
    }
)

// ************************************************************************* //
