tutorials/compressible/nexaFoam/neTCLib/bluntedCone/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressureValue;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $pressureValue;
    }

    cone
    {
        type            zeroGradient;
    }

    wedge1
    {
        type            wedge;
    }

    wedge2
    {
        type            wedge;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
