tutorials/compressible/nexaFoam/neTCLib/bluntedCone/0/TTR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      TTR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TTRValue;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $TTRValue;
    }

    cone
    {
        type                smoluchowskiJumpT;
        accommodationCoeff  $accommodationCoeff;
        Twall               uniform $TwallValue;
        value               uniform $TTRValue;
    }

    wedge1
    {
        type            wedge;
    }

    wedge2
    {
        type            wedge;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
